Longan-Labs/Longan-RP2040/1.0.1/boards.txt
# -----------------------------------
# OBD-II 2G Dev Kit (RP2040)
# -----------------------------------
obd2g2040.name=Squama Ethernet 2040
obd2g2040.vid.0=0x2e8a
obd2g2040.pid.0=0x000a
obd2g2040.build.usbpid=-DSERIALUSB_PID=0x000a
obd2g2040.build.board=RASPBERRY_PI_PICO
obd2g2040.build.mcu=cortex-m0plus
obd2g2040.build.variant=rpipico
obd2g2040.upload.tool=uf2conv
obd2g2040.upload.maximum_size=2097152
obd2g2040.upload.maximum_data_size=262144
obd2g2040.upload.wait_for_upload_port=true
obd2g2040.upload.erase_cmd=
obd2g2040.serial.disableDTR=false
obd2g2040.serial.disableRTS=false
obd2g2040.build.f_cpu=125000000
obd2g2040.build.led=
obd2g2040.build.core=rp2040
obd2g2040.build.mcu=rp2040
obd2g2040.build.ldscript=memmap_default.ld
obd2g2040.build.ram_length=256k
obd2g2040.build.boot2=boot2_w25q080_2_padded_checksum
obd2g2040.build.vid=0x2e8a
obd2g2040.build.pid=0x000a
obd2g2040.build.usb_manufacturer="Raspberry Pi"
obd2g2040.build.usb_product="Pico"
obd2g2040.menu.flash.2097152_0=2MB (no FS)
obd2g2040.menu.flash.2097152_0.upload.maximum_size=2093056
obd2g2040.menu.flash.2097152_0.build.flash_length=2093056
obd2g2040.menu.flash.2097152_0.build.eeprom_start=270528512
obd2g2040.menu.flash.2097152_0.build.fs_start=270528512
obd2g2040.menu.flash.2097152_0.build.fs_end=270528512
obd2g2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
obd2g2040.menu.flash.2097152_65536.upload.maximum_size=2027520
obd2g2040.menu.flash.2097152_65536.build.flash_length=2027520
obd2g2040.menu.flash.2097152_65536.build.eeprom_start=270528512
obd2g2040.menu.flash.2097152_65536.build.fs_start=270462976
obd2g2040.menu.flash.2097152_65536.build.fs_end=270528512
obd2g2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
obd2g2040.menu.flash.2097152_131072.upload.maximum_size=1961984
obd2g2040.menu.flash.2097152_131072.build.flash_length=1961984
obd2g2040.menu.flash.2097152_131072.build.eeprom_start=270528512
obd2g2040.menu.flash.2097152_131072.build.fs_start=270397440
obd2g2040.menu.flash.2097152_131072.build.fs_end=270528512
obd2g2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
obd2g2040.menu.flash.2097152_262144.upload.maximum_size=1830912
obd2g2040.menu.flash.2097152_262144.build.flash_length=1830912
obd2g2040.menu.flash.2097152_262144.build.eeprom_start=270528512
obd2g2040.menu.flash.2097152_262144.build.fs_start=270266368
obd2g2040.menu.flash.2097152_262144.build.fs_end=270528512
obd2g2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
obd2g2040.menu.flash.2097152_524288.upload.maximum_size=1568768
obd2g2040.menu.flash.2097152_524288.build.flash_length=1568768
obd2g2040.menu.flash.2097152_524288.build.eeprom_start=270528512
obd2g2040.menu.flash.2097152_524288.build.fs_start=270004224
obd2g2040.menu.flash.2097152_524288.build.fs_end=270528512
obd2g2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
obd2g2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
obd2g2040.menu.flash.2097152_1048576.build.flash_length=1044480
obd2g2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
obd2g2040.menu.flash.2097152_1048576.build.fs_start=269479936
obd2g2040.menu.flash.2097152_1048576.build.fs_end=270528512
obd2g2040.menu.freq.125=125 MHz
obd2g2040.menu.freq.125.build.f_cpu=125000000L
obd2g2040.menu.freq.50=50 MHz
obd2g2040.menu.freq.50.build.f_cpu=50000000L
obd2g2040.menu.freq.100=100 MHz
obd2g2040.menu.freq.100.build.f_cpu=100000000L
obd2g2040.menu.freq.133=133 MHz
obd2g2040.menu.freq.133.build.f_cpu=133000000L
obd2g2040.menu.freq.150=150 MHz (Overclock)
obd2g2040.menu.freq.150.build.f_cpu=150000000L
obd2g2040.menu.freq.175=175 MHz (Overclock)
obd2g2040.menu.freq.175.build.f_cpu=175000000L
obd2g2040.menu.freq.200=200 MHz (Overclock)
obd2g2040.menu.freq.200.build.f_cpu=200000000L
obd2g2040.menu.freq.225=225 MHz (Overclock)
obd2g2040.menu.freq.225.build.f_cpu=225000000L
obd2g2040.menu.freq.250=250 MHz (Overclock)
obd2g2040.menu.freq.250.build.f_cpu=250000000L
obd2g2040.menu.freq.275=275 MHz (Overclock)
obd2g2040.menu.freq.275.build.f_cpu=275000000L
obd2g2040.menu.freq.300=300 MHz (Overclock)
obd2g2040.menu.freq.300.build.f_cpu=300000000L
obd2g2040.menu.dbgport.Disabled=Disabled
obd2g2040.menu.dbgport.Disabled.build.debug_port=
obd2g2040.menu.dbgport.Serial=Serial
obd2g2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
obd2g2040.menu.dbgport.Serial1=Serial1
obd2g2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
obd2g2040.menu.dbgport.Serial2=Serial2
obd2g2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
obd2g2040.menu.dbglvl.None=None
obd2g2040.menu.dbglvl.None.build.debug_level=
obd2g2040.menu.dbglvl.Core=Core
obd2g2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
obd2g2040.menu.dbglvl.SPI=SPI
obd2g2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
obd2g2040.menu.dbglvl.Wire=Wire
obd2g2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
obd2g2040.menu.dbglvl.All=All
obd2g2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
obd2g2040.menu.dbglvl.NDEBUG=NDEBUG
obd2g2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
obd2g2040.menu.usbstack.picosdk=Pico SDK
obd2g2040.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
obd2g2040.menu.usbstack.tinyusb=Adafruit TinyUSB
obd2g2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

# -----------------------------------
# HUD Dev kit (RP2040)
# -----------------------------------
hud2040.name=HUD Dev kit (RP2040)
hud2040.vid.0=0x2e8a
hud2040.pid.0=0x000a
hud2040.build.usbpid=-DSERIALUSB_PID=0x000a
hud2040.build.board=RASPBERRY_PI_PICO
hud2040.build.mcu=cortex-m0plus
hud2040.build.variant=rpipico
hud2040.upload.tool=uf2conv
hud2040.upload.maximum_size=2097152
hud2040.upload.maximum_data_size=262144
hud2040.upload.wait_for_upload_port=true
hud2040.upload.erase_cmd=
hud2040.serial.disableDTR=false
hud2040.serial.disableRTS=false
hud2040.build.f_cpu=125000000
hud2040.build.led=
hud2040.build.core=rp2040
hud2040.build.mcu=rp2040
hud2040.build.ldscript=memmap_default.ld
hud2040.build.ram_length=256k
hud2040.build.boot2=boot2_w25q080_2_padded_checksum
hud2040.build.vid=0x2e8a
hud2040.build.pid=0x000a
hud2040.build.usb_manufacturer="Raspberry Pi"
hud2040.build.usb_product="Pico"
hud2040.menu.flash.2097152_0=2MB (no FS)
hud2040.menu.flash.2097152_0.upload.maximum_size=2093056
hud2040.menu.flash.2097152_0.build.flash_length=2093056
hud2040.menu.flash.2097152_0.build.eeprom_start=270528512
hud2040.menu.flash.2097152_0.build.fs_start=270528512
hud2040.menu.flash.2097152_0.build.fs_end=270528512
hud2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
hud2040.menu.flash.2097152_65536.upload.maximum_size=2027520
hud2040.menu.flash.2097152_65536.build.flash_length=2027520
hud2040.menu.flash.2097152_65536.build.eeprom_start=270528512
hud2040.menu.flash.2097152_65536.build.fs_start=270462976
hud2040.menu.flash.2097152_65536.build.fs_end=270528512
hud2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
hud2040.menu.flash.2097152_131072.upload.maximum_size=1961984
hud2040.menu.flash.2097152_131072.build.flash_length=1961984
hud2040.menu.flash.2097152_131072.build.eeprom_start=270528512
hud2040.menu.flash.2097152_131072.build.fs_start=270397440
hud2040.menu.flash.2097152_131072.build.fs_end=270528512
hud2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
hud2040.menu.flash.2097152_262144.upload.maximum_size=1830912
hud2040.menu.flash.2097152_262144.build.flash_length=1830912
hud2040.menu.flash.2097152_262144.build.eeprom_start=270528512
hud2040.menu.flash.2097152_262144.build.fs_start=270266368
hud2040.menu.flash.2097152_262144.build.fs_end=270528512
hud2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
hud2040.menu.flash.2097152_524288.upload.maximum_size=1568768
hud2040.menu.flash.2097152_524288.build.flash_length=1568768
hud2040.menu.flash.2097152_524288.build.eeprom_start=270528512
hud2040.menu.flash.2097152_524288.build.fs_start=270004224
hud2040.menu.flash.2097152_524288.build.fs_end=270528512
hud2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
hud2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
hud2040.menu.flash.2097152_1048576.build.flash_length=1044480
hud2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
hud2040.menu.flash.2097152_1048576.build.fs_start=269479936
hud2040.menu.flash.2097152_1048576.build.fs_end=270528512
hud2040.menu.freq.125=125 MHz
hud2040.menu.freq.125.build.f_cpu=125000000L
hud2040.menu.freq.50=50 MHz
hud2040.menu.freq.50.build.f_cpu=50000000L
hud2040.menu.freq.100=100 MHz
hud2040.menu.freq.100.build.f_cpu=100000000L
hud2040.menu.freq.133=133 MHz
hud2040.menu.freq.133.build.f_cpu=133000000L
hud2040.menu.freq.150=150 MHz (Overclock)
hud2040.menu.freq.150.build.f_cpu=150000000L
hud2040.menu.freq.175=175 MHz (Overclock)
hud2040.menu.freq.175.build.f_cpu=175000000L
hud2040.menu.freq.200=200 MHz (Overclock)
hud2040.menu.freq.200.build.f_cpu=200000000L
hud2040.menu.freq.225=225 MHz (Overclock)
hud2040.menu.freq.225.build.f_cpu=225000000L
hud2040.menu.freq.250=250 MHz (Overclock)
hud2040.menu.freq.250.build.f_cpu=250000000L
hud2040.menu.freq.275=275 MHz (Overclock)
hud2040.menu.freq.275.build.f_cpu=275000000L
hud2040.menu.freq.300=300 MHz (Overclock)
hud2040.menu.freq.300.build.f_cpu=300000000L
hud2040.menu.dbgport.Disabled=Disabled
hud2040.menu.dbgport.Disabled.build.debug_port=
hud2040.menu.dbgport.Serial=Serial
hud2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
hud2040.menu.dbgport.Serial1=Serial1
hud2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
hud2040.menu.dbgport.Serial2=Serial2
hud2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
hud2040.menu.dbglvl.None=None
hud2040.menu.dbglvl.None.build.debug_level=
hud2040.menu.dbglvl.Core=Core
hud2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
hud2040.menu.dbglvl.SPI=SPI
hud2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
hud2040.menu.dbglvl.Wire=Wire
hud2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
hud2040.menu.dbglvl.All=All
hud2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
hud2040.menu.dbglvl.NDEBUG=NDEBUG
hud2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
hud2040.menu.usbstack.picosdk=Pico SDK
hud2040.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
hud2040.menu.usbstack.tinyusb=Adafruit TinyUSB
hud2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
